# Add Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..Add Method
ExportPatternTable Class See Also
---
Inserts a (key,info) pair into Export pattern table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Add(
	ExportPatternKey exportPatternKey,
	ExportPatternInfo exportPatternInfo
)
```

Visual Basic
---
```text
Public Sub Add ( _
	exportPatternKey As ExportPatternKey, _
	exportPatternInfo As ExportPatternInfo _
)
```

Visual C++
---
```text
public:
void Add(
	ExportPatternKey^ exportPatternKey,
	ExportPatternInfo^ exportPatternInfo
)
```

# ### Parameters
exportPatternKey
    Type: Autodesk.Revit.DB..::..ExportPatternKey The export pattern key to be added.
exportPatternInfo
    Type: Autodesk.Revit.DB..::..ExportPatternInfo The export pattern info to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The key already exists in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace